app/Http/Controllers/Client/HomeController.php

select * from `Slide` where `hienthi` = '1'
select * from `BaiViet` order by `id` desc limit 1
select * from `BaiViet` where `ghim` != '1' order by `id` desc limit 4
select * from `Ghim` order by `id` desc limit 2
select * from `ChuDe` where `duan` = '1' order by `id` desc limit 4
select * from `ChuDe` where `trongtam` = '1'
select `HinhAnhBlock`.* from `HinhAnhBlock` inner join `BlockContent` on `HinhAnhBlock`.`blockid` = `BlockContent`.`id` inner join `ChuDe` on `BlockContent`.`chudeid` = `ChuDe`.`id` where `ChuDe`.`id` = '2' order by `id` desc
---
    public function Index()
    {
        $date = date("Y-m-d");
        $dsslide = Slide::where('hienthi', 1)->get();
        foreach($dsslide as $key => $slide)
        {
            if(strtotime($slide->ngayketthuc) < strtotime($date))
            {
                unset($dsslide[$key]);
            }

            if(strtotime($slide->ngaybatdau) > strtotime($date))
            {
                unset($dsslide[$key]);
            }
        }
        $baivietmoinhat = BaiViet::orderBy('id', 'desc')->first()->get();
        $dsbaiviet = BaiViet::where('ghim', '!=', 1)->orderBy('id', 'desc')->take(4)->get();
        $dsbaighim = Ghim::orderBy('id', 'desc')->take(2)->get();
        $dsduan = ChuDe::where('duan', 1)->orderBy('id', 'desc')->take(4)->get();
        $duantrongtam = ChuDe::where('trongtam', 1)->get();
        $dshinhanh = DB::table('HinhAnhBlock')
            ->join('BlockContent', 'HinhAnhBlock.blockid', '=', 'BlockContent.id')
            ->join('ChuDe', 'BlockContent.chudeid', '=', 'ChuDe.id')
            ->where('ChuDe.id', '=', $duantrongtam[0]->id)
            ->select('HinhAnhBlock.*')
            ->orderBy('id', 'desc')
            ->get();