app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `ChuDe` where `duan` = '0'
select count(*) as aggregate from `ChuDe` where `duan` = '1'
select count(*) as aggregate from `users`
---
    public function Index()
    {
        $chude = ChuDe::where('duan', 0)->count();
        $duan = ChuDe::where('duan', 1)->count();
        $lienhe = LienHe::count();
        $nguoidung = User::count();