app/Http/Controllers/Admin/AlbumController.php

    public function Reload()
    {
        $dsalbum = Album::orderBy('id', 'desc')->get();
---
select * from `Album` order by `id` desc

    public function Index()
    {
        $dsalbum = json_encode(Album::orderBy('id', 'desc')->get());
---
select * from `Album` order by `id` desc

    public function Save(Request $request)
    {
        $mss = new Message(true, "Thêm thành công");
        if($request->ajax())
        {
            $album = new Album;
            $mota = $request->input('mota');
            if($request->hasFile('duongdan'))
            {
                $file = $request->file('duongdan');
                $duoi = $file->getClientOriginalExtension();
                $name = chop($file->getClientOriginalName(),('.'.$duoi));
                if ($duoi != 'jpg' && $duoi != 'png' && $duoi != 'jpeg')
                {
                    $mss->status = false;
                    $mss->message = "Sai định dạng ảnh";
                    return response(json_encode($mss));
                }
                $name = str_random(4). changeTitle($name).'.'. $duoi;
                try {
                    $album->mota = $mota;
                    $album->hinhanh = $name;
                    $album->save();
---
insert into `Album` (`mota`, `hinhanh`, `updated_at`, `created_at`) values ('fasdfa', '1MiXimg-avatar2.png', '2018-05-19 15:39:12', '2018-05-19 15:39:12')

    public function Show($id)
    {
        $album = Album::findOrFail($id);
---
select * from `Album` where `Album`.`id` = '316' limit 1

    public function Edit($id)
    {
        $album = Album::findOrFail($id);
---
select * from `Album` where `Album`.`id` = '316' limit 1

    public function Update(Request $request)
    {
        $mss = new Message(true, 'Cập nhật thành công');
        if ($request->ajax())
        {
            $album = Album::find($request->get('id'));
            $album->mota = $request->get('mota');
            try {
            $album->save();
---
select * from `Album` where `Album`.`id` = '316' limit 1
update `Album` set `mota` = 'fasdfa fasdfasd', `updated_at` = '2018-05-19 15:39:20' where `id` = '316'