app/Http/Controllers/Admin/BannerController.php

    public function Reload()
    {
        $dsbanner = Banner::orderBy('id', 'desc')->get();
---
select * from `Banner` order by `id` desc

    public function Index()
    {
        $dsbanner_model = Banner::orderBy('id', 'desc')->get();
---
select * from `Banner` order by `id` desc

    public function Destroy($id)
    {
        Banner::destroy($id);
---
delete from `Banner` where `id` = '2'