app/Http/Controllers/Admin/ChuDeController.php

select * from `ChuDe` order by `id` desc
---
    public function Index()
    {
        $dschude6 = ChuDe::orderBy('id', 'desc')->get();