app/Http/Controllers/Admin/GhimController.php

select `Ghim`.*, `BaiViet`.`tenbaiviet` from `Ghim` inner join `BaiViet` on `Ghim`.`baivietid` = `BaiViet`.`id` order by `id` desc
---
    public function Index()
    {
        $dsghim = json_encode(DB::table('Ghim')
            ->join('BaiViet', 'Ghim.baivietid', '=', 'BaiViet.id')
            ->select('Ghim.*', 'BaiViet.tenbaiviet')
            ->orderBy('id', 'desc')
            ->get());