app/Http/Controllers/Admin/SlideController.php

select * from `Slide` order by `id` desc
---
    public function Index()
    {
        $dsslide = json_encode(Slide::orderBy('id', 'desc')->get());