app/Http/Controllers/Admin/UserController.php

select * from `users` where `id` != '7' order by `id` desc
---
    public function Index()
    {
        $id = Auth::User()->id;
        $dsnguoidung = User::where('id', '!=', $id)->orderBy('id', 'desc')->get();

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Cuong', 'kuonvu.j3r7y@gmail.com', 'y$aqywjvaATKWeC.C.NV9nvubk56WeOXOtcGSn69lqYmf5h4oX2beIO', '2018-05-19 15:20:49', '2018-05-19 15:20:49')
---
    public function SaveCreate(Request $request)
    {
        $rs = new Message(true);
        try{
            $ngdung = new User;
            $ngdung->name = $request->get("taiKhoan");
            $ngdung->email = $request->get("email");
            $ngdung->password = bcrypt($request->get("matKhau"));
            $ngdung->save();

select * from `users` where `email` = 'kuonvu.j3r7y@gmail.com' order by `created_at` desc limit 1
---
    public function CheckExist(Request $request)
    {
        $rs= new Message(false);
        $name = $request->taikhoan;
        $taiKhoan = User::where('email','=',$name)->latest()->take(1)->get();